clc
clear
close all

% 定义 DH 参数
a = [0, 0, 0, 0, 0, 0];
alpha = [90, 0, 90, 90, -90, 0];
d = [0, 0, d4, 0, 0, d6];
theta = [q1, q2, q3, q4, q5, 0];

% 仿真验证
q1 = -30; q2 = 30; q3 = 60; q4 = -45; q5 = 30; d4 = 200; d6 = 100;
q = [q1, q2, q3, q4, q5, d4, d6]/180*pi; % 将角度转换为弧度

T = FK(q) % 计算从基座到末端执行器的变换矩阵

% 画出机械臂的模型
L1 = Link([0, 0, 0, pi/2]);
L2 = Link([0, 0, 0, 0]);
L3 = Link([0, d4, 0, pi/2]);
L4 = Link([0, 0, 0, pi/2]);
L5 = Link([0, 0, 0, -pi/2]);
L6 = Link([0, d6, 0, 0]);
robot = SerialLink([L1, L2, L3, L4, L5, L6], 'name', 'my_robot');
robot.plot(q); % 绘制机械臂在当前状态下的姿态
T =
[ 1, 0, 0, 0]
[ 0, 0, 1, 350]
[ 0,-1, 0, 150]
[ 0, 0, 0,   1]
``